# Linux and macOS
brew "ag"
brew "archiver"
brew "gh"
brew "rclone"
brew "rg"
brew "tmux"
brew "vim"
brew "wget"
brew "ykman"

brew "go"
brew "rust"
brew "rustup"

tap "powershell/tap"
brew "powershell"

# Casks (macOS)
cask "1password"
cask "1password-cli"
cask "google-chrome"
cask "visual-studio-code"
cask "zoom"
cask "spotify"
cask "iTerm2"
cask "Signal"

brew "mas" if OS.mac?

mas "1Password for Safari", id: 1569813296
mas "Tailscale", id: 1475387142
mas "1Blocker", id: 1365531024
mas "WhatsApp", id: 310633997
mas "Xcode", id: 497799835
