tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"

# Linux and macOS
brew "ag"
brew "archiver"
brew "go"
brew "gh"
brew "tmux"
brew "vim"
brew "wget"
brew "mas" if OS.mac?
brew "ykman"

# Casks (macOS)
cask "1password"
cask "1password-cli"
cask "docker"
cask "google-chrome"
cask "visual-studio-code"
cask "zoom"
cask "spotify"
cask "iTerm2"

mas "1Password for Safari", id: 1569813296
